({
  "_id": {
    "$oid": "5adf1f81a8956f0014019b89"
  },
  "title": "UK National Cyber Security Centre Includes Cryptojacking In Report On Cyber Threats",
  "image": "https://i.imgur.com/MDszwFI.jpg",
  "author": "Elijah ifeanyi ",
  "category": "NEWS",
  "intro": "UK National Cyber Security Centre Includes Cryptojacking In Report ",
  "body": "<p dir=\"ltr\">On 10th April, the UK National Cyber Security Centre (NCSC)&nbsp;released a report&nbsp;analyzing how nefarious cyber activity influenced the business environment in Great Britain over the past year.</p>\r\n\r\n<p dir=\"ltr\">The report dedicates a section to&nbsp;cryptojacking, a form of cyber attack in which a hacker utilizes an individual&rsquo;s computer, without the owner&rsquo;s knowledge, to mine&nbsp;cryptocurrencies. Often the only way to notice that a device is being cryptojacked is a slight slowdown in performance.</p>\r\n\r\n<p dir=\"ltr\">The NCSC believes that, with the growing interest in cryptocurrencies, methods of digital currencies mining via users&rsquo; CPU power, such as cryptojacking, will probably become a steady source of revenue for website owners and hackers . According to the report:</p>\r\n\r\n<blockquote>\r\n<p dir=\"ltr\">&ldquo;The technique of delivering cryptocurrency miners through malware has been used for several years, but it is likely in 2018-19 that one of the main threats will be a newer technique of mining cryptocurrency which exploits visitors to a website.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p dir=\"ltr\">The report states that incidences of cryptojacking increased in 2017. In December 2017, 55 percent of businesses worldwide were impacted by cryptocurrency miners. In February 2018, more than 4,000 websites globally (including about 600 in the UK) secretly mined&nbsp;<a href=\"https://cointelegraph.com/search?query=digital+currency\">digital currency</a>&nbsp;with compromised screen-reading plugins designed for blind and partially sighted people.</p>\r\n\r\n<p dir=\"ltr\">The NCSC believes that the majority of cryptojacking is performed by cyber criminals. However, website owners have also targeted visitors and utilized the CPU power of visitors&rsquo; computers to mine cryptocurrency to their own advantage.</p>\r\n\r\n<p dir=\"ltr\">In past years, malware&nbsp;has proven itself to be an effective technique for mining cryptocurrencies through exploiting common users&rsquo; software vulnerabilities. Last month,&nbsp;Microsofts Windows Defender Antivirus&nbsp;blocked over 400,000&nbsp;attempts of malware to infect users with a cryptocurrency miner in a 12 hour span.</p>\r\n\r\n<p>In January, the Opera web browser&nbsp;announced&nbsp;&nbsp;they would add anti-crypto mining to their mobile browser after including it in their integrated ad blocker for desktop.</p>\r\n",
  "created": {
    "$date": "2018-04-24T12:13:53.652Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5aeeffe8accb02001433a6de"
  },
  "title": "BTC Close To Smashing $10K mark",
  "image": "https://i.imgur.com/woSiyZF.png",
  "author": "Jerry Ifeanyi ",
  "category": "News",
  "intro": "Bitcoin on the rise again ",
  "body": "<p>Saturday, May 5 : All eyes are on the markets this week as they consolidate a rally to levels not seen since early March, with Ethereum (ETH) and Bitcoin (BTC) leading the way, as data from <a>Coin360</a> shows.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><a>Bitcoin</a> (BTC) has been tantalizingly close to breaking the $10,000 threshold, trading at <a>$9,942</a> to press time, and as high as $9,991 over the 24 hour period.</p>\r\n\r\n<p><img alt=\"Bitcoin Charts\"></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Crypto commenter Joseph Young has pointed out that looking beyond the global markets&rsquo; average, BTC has in fact already broken through $10,000 on Asian markets.</p>\r\n",
  "created": {
    "$date": "2018-05-06T13:15:20.640Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5adef65a08f22b00147a5fa2"
  },
  "title": "Bitpay Confirms Bitcoincash As Retail Payments Cause For price Spike",
  "image": "https://i.imgur.com/b7W4KR2.png",
  "author": "Elijah Ifeanyi",
  "category": "NEWS",
  "intro": "Bitpay Confirms Bitcoincash As Retail Payments Cause For price Spike",
  "body": "<p>Cryptocurrency payment service provider BitPay has&nbsp;<a href=\"https://blog.bitpay.com/bitpay-checkout/\">announced</a>&nbsp;that it will allow&nbsp;brick-and-mortar businesses to use Bitcoin Cash for payments. Already available for Bitcoin, the new service will give customers the option to choose between paying in bitcoin or bitcoincash.</p>\r\n\r\n<p>BitPay Checkout, used by restaurants and other retail businesses, is currently being used in Atlanta, Toronto,&nbsp;St. Petersburg, Madeira Beach and Paris. BitPay has been serving these entities since Nov. 2014, which is why the company has decided to include more options for crypto payments. With 1% processing fee and integration with companies such as Shopify,&nbsp;3DCart and&nbsp;Bitmonet, BCH users will find the new update favorable.</p>\r\n\r\n<p>&ldquo;When customers go to pay, they can select their currency of choice, select the option to give a tip, then scan a BitPay Checkout QR code with their mobile wallets,&rdquo; BitPay wrote. &ldquo;Payments take just a swipe or a tap, and the receiving merchant gets a local currency bank settlement within one business day. Merchants get every dollar or euro they charge, minus BitPay&rsquo;s 1% processing fee.&rdquo;</p>\r\n\r\n<p><a href=\"https://www.ccn.com/bitpay-merchants-can-now-accept-bitcoin-cash-payments/\">Last month</a>, BitPay upgraded their system so that buyers using the platform could accept online payments in Bitcoin Cash as well as Bitcoin. After joining the crypto community in 2011, this was the first time an altcoin was included by the company. The press release stated that merchants integrating BitPay for small-scale transactions including video games and app downloads would find it easier &ldquo;since Bitcoin Cash costs only pennies (or less) for customers to send&rdquo;.</p>\r\n\r\n<p>Last year,&nbsp;BitPay co-founder,&nbsp;Stephen Pair, said that after careful observation, they found out that no bitcoin alternative was innovative or &ldquo;compelling&rdquo;. Despite scaling issues, Pair concluded that Bitcoin was the best cryptocurrency till date. However, following Bitcoin Cash&rsquo;s launch in August, BitPay allowed users to store and spend BCH in its open source wallet,&nbsp;<a href=\"https://www.ccn.com/rally-ethereum-bitcoin-prices-lead-markets-20-billion-advance/\">Copay</a>. This announcement was considered as one of the reasons behind the increase in BCH&rsquo;s price from $313 to $431 within 24 hours in Sep. 2017. The next month, BitPay&nbsp;<a href=\"https://blog.bitpay.com/multiple-blockchains/\">confirmed</a>&nbsp;that it would begin accepting &ldquo;additional blockchain payment methods&rdquo; starting with BCH. Once again, the news caused BCH to break records by crossing the $2,000 mark.</p>\r\n\r\n<p><a href=\"https://www.ccn.com/bitcoin-cash-price-leaps-19-as-other-large-caps-flounder/\">Bitcoin Cash</a>, currently the fourth-largest cryptocurrency, has once again increased by almost 19% after BitPay&rsquo;s announcement today. However, the price was already rising upwards &ndash; it is now up 100% in one week. The market cap has also doubled within these seven days, climbing from $12 billion to $24 billion.</p>\r\n\r\n<p>https://i.imgur.com/DYVq4HH.png<a href=\"https://i.imgur.com/DYVq4HH.png\" target=\"_self\"><img alt=\"\" src=\"https://i.imgur.com/DYVq4HH.png\" /></a><img alt=\"\" src=\"https://i.imgur.com/DYVq4HH.png\" style=\"float:right; height:208px; width:400px\" /><img alt=\"\" src=\"https://i.imgur.com/DYVq4HH.png\" style=\"float:right; height:182px; width:350px\" /></p>\r\n",
  "created": {
    "$date": "2018-04-24T09:18:18.927Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5adf17cba8956f0014019b88"
  },
  "title": "Indian Police Superintended Arrested For alleged kidnapping And Bitcoin Extortion ",
  "image": "https://i.imgur.com/qFWKgyy.jpg",
  "author": "Elijah ifeanyi ",
  "category": "NEWS",
  "intro": "A Police superintendent from Gujarat,india,arrested ",
  "body": "A police superintendent from Gujarat,india, has been arrested in regards to the alleged kidnapping and Bitcoin extortion of a businessman, of which 10 police officers have already been accused, local news outlet the Hindustan Times; reported Monday, April 23.\r\n\r\n<p>Indian businessman and builder Sailesh Bhatt reported that police officers beat him, extorted money from him, and then kidnapped him and kept him confined at a farmhouse until he paid a further ransom in cryptocurrency. The amount of crypto alleged to be stolen is between $1.8-2 mln.</p>\r\n\r\n<p>Superintendent Jagdish Patel was arrested in his official residence in Amreli two nights ago, and will be will be interrogated along with accused police inspector Anant Patel,&rdquo; according to a police officer, the Hindustan Times writes. Previous reports on Bhatt&rsquo;s claim noted that inspector Patel had absconded, but the Hindustan Times adds that he has since been arrested last week\r\n\r\nThree police officers and one lawyer have also been arrested in connection with the case, according to the Hindustan Times.\r\n\r\nThe Hindustan Times writes that a former member of the political Gujarat Parivartan Party, Nalin Kotadia, is likely to be questioned. Bhatt named Kotadia as pressuring him to accept the ransom request.\r\n\r\nIn a larger case of theft in India, Indian crypto exchange Coinsecure reported the loss of around 485 BTC (around $4.4 mln at current BTC prices) due to alleged misconduct by an employee.</p>\r\n",
  "created": {
    "$date": "2018-04-24T11:40:59.890Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5ae02e91ac6b820014ff2168"
  },
  "title": "Binance Leads 30mln Funding For New Cryptocurrency ",
  "image": "https://i.imgur.com/0N0MI6P.png",
  "author": "Elijah ifeanyi ",
  "category": "NEWS",
  "intro": "Cryptocurrency announced binance will lead 30mln fundraising round",
  "body": "<p dir=\"ltr\">A new cryptocurrency &quot;mobilecoin&quot;, announced that Binance Labs will lead a $30 mln round of fundraising for the project, according to a Medium post April 24 ,blockchain technology incubator associated with the&nbsp;Binance&nbsp;cryptocurrency exchange is leading a $30 mln round of investment denominated in&nbsp;Bitcoin&nbsp;&nbsp;(BTC) and&nbsp;Ethereum&nbsp;(ETH).&nbsp;According to Techcrunch, the new cryptocurrency could &ldquo;enjoy &lsquo;priority consideration&rsquo; for being listed on Binance as part of the relationship.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">In addition to working with Binance Labs, MobileCoin has on-boarded talent like Moxie Marlinspike, founder of encrypted messaging app Signal, as a technical advisor. Shane Glynn, who has served as product counsel at&nbsp;Google&nbsp;since 2010, work as legal counsel, ensuring MobileCoin is compliant with crypto regulations.</p>\r\n\r\n<p dir=\"ltr\">In the MobileCoin&nbsp;whitepaper&nbsp;published in December 2017, the project&rsquo;s creators described their intention to develop a &ldquo;fast, private, and easy-to-use&nbsp;cryptocurrency&nbsp;that can be deployed in resource constrained environments to users who aren&rsquo;t equipped to reliably maintain secret keys over a long period of time, all without giving up control of funds to a payment processing service.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">MobileCoin will reportedly use the&nbsp;Steller consensus protocol (SCP)&nbsp;&nbsp;in order to synchronize to the coin&rsquo;s network and assure scalability and speed, while the end product will be integrated into mobile messaging apps:</p>\r\n\r\n<blockquote>\r\n<p dir=\"ltr\">&ldquo;MobileCoin is designed so that a mobile messaging application like WhatsApp, Facebook Messenger, or Signal could integrate with a MobileCoin wallet.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p dir=\"ltr\">Binance Labs commented on the funding:</p>\r\n\r\n<blockquote>\r\n<p dir=\"ltr\">&ldquo;A mobile-first, user-friendly cryptocurrency, like MobileCoin, plays a critical role in driving mainstream cryptocurrency adoption. The MobileCoin team and Binance Labs share a common vision and we are proud to be a supporter of what they are doing.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p>Recently, Binance&nbsp;partnered&nbsp;&nbsp;with Ugandan Blockchain organization Crypto Savannah. The collaboration intends to support economic development of the East&nbsp;African country by generating employment and attracting investment to the country.</p>\r\n",
  "created": {
    "$date": "2018-04-25T07:30:25.093Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5ae1a25df651df0014df0c26"
  },
  "title": "'New Money' On Bitcoin, Not Bitcoin Cash :Experts Survey",
  "image": "https://i.imgur.com/EqoefAh.jpg",
  "author": "Elijah Ifeanyi",
  "category": "NEWS",
  "intro": "Thomas Lee, co-founder of Fundstrat Global, doesn’t like to take sides in the bitcoin/Bitcoin Cash rivalry. But holding his feet to the fire, Lee would bet on the No. 1 cryptocurrency over its spin-off, Bitcoin Cash.",
  "body": "<p>Thomas Lee, co-founder of Fundstrat Global, doesn&rsquo;t like to take sides in the bitcoin/Bitcoin Cash rivalry. But holding his feet to the fire, Lee would bet on the No. 1 cryptocurrency over its spin-off, Bitcoin Cash.</p>\r\n\r\n<p>Bitcoin and Bitcoin Cash advocates have locked horns over which is the better digital currency, and Lee&rsquo;s decision isn&rsquo;t all that surprising given he&rsquo;s calling for a $25,000 bitcoin&nbsp;&nbsp;price by year-end. Lee tells CNBC:</p>\r\n\r\n<blockquote>\r\n<p>&ldquo;I prefer not to pick winners and losers when we&rsquo;re looking at cryptocurrencies like bitcoin/Bitcoin Cash. I think both have merits. But if I were putting new money to work today, so a fresh dollar, I would be a lot more interested in buying a laggard that could attract inflows rather than something that&rsquo;s already potentially overbought.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p>Earlier this month, cryptocurrency fund manager Brian Kelly similarly made headlines&nbsp;for betting on Bitcoin Cash, the No. 4 digital currency based on market cap whose followers believe is the Second Coming for its features that capitalize on bitcoin&rsquo;s issues &mdash; transaction speed and cost. The Bitcoin Cash price rallied in recent weeks amid an upcoming hard fork that&rsquo;s scheduled for mid-May.</p>\r\n\r\n<p>Lee suggests that Bitcoin Cash is &ldquo;overbought&rdquo;, pointing to Kelly&rsquo;s &ldquo;new entry&rdquo; in Bitcoin Cash as helping to drive the price higher, though the BCH price has pulled back some from last week&rsquo;s rally.</p>\r\n\r\n<p><a href=\"https://248qms3nhmvl15d4ne1i4pxl-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/bch.jpg\" title=\"'New Money' is on Bitcoin, Not Bitcoin Cash: Fundstrat's Tom Lee\"><img alt=\"\" src=\"https://248qms3nhmvl15d4ne1i4pxl-wpengine.netdna-ssl.com/wp-content/uploads/2018/04/bch.jpg\" style=\"height:601px; width:788px\" /></a></p>\r\n\r\n<h2>Bitcoin Bottom</h2>\r\n\r\n<p>Meanwhile, Lee has been arguing that bitcoin has bottomed&nbsp;and recently tweeted that institutional interest &ldquo;is a leading indicator for flows of big money into crypto.&rdquo;</p>\r\n\r\n<p><a href=\"https://twitter.com/fundstrat/status/988817606604881920/photo/1\" tabindex=\"-1\" title=\"View image on Twitter\">View image on Twitter</a></p>\r\n\r\n<p><a href=\"https://twitter.com/fundstrat/status/988817606604881920/photo/1\"><img alt=\"View image on Twitter\" src=\"https://pbs.twimg.com/media/Dbj8X0JW0AAiQAH?format=jpg&amp;name=small\" style=\"height:938px; width:1200px\" title=\"View image on Twitter\" /></a></p>\r\n\r\n<blockquote><a href=\"https://twitter.com/fundstrat\"><img alt=\"\" src=\"https://pbs.twimg.com/profile_images/510834353283145729/CtFjYadW_normal.jpeg\" /></a>\r\n\r\n<p><a href=\"https://twitter.com/fundstrat\">Thomas Lee@fundstrat</a></p>\r\n\r\n<p dir=\"ltr\">CRYPTO: We hosted a small group of institutional investors on 4/23, mix of crypto and traditional macro HF/long-only. Results below. Key takeaway, institutions believe <a dir=\"ltr\" href=\"https://twitter.com/hashtag/BTC?src=hash\" rel=\"tag\">#BTC</a> bottomed. We see this as a leading indicator for inflows of big money into Crypto</p>\r\n\r\n<p><a href=\"https://twitter.com/fundstrat/status/988817606604881920\">9:31 AM - Apr 24, 2018</a></p>\r\n\r\n<ul>\r\n\t<li><a href=\"https://twitter.com/intent/like?tweet_id=988817606604881920\" title=\"Like\">1,051</a></li>\r\n\t<li><a href=\"https://twitter.com/fundstrat/status/988817606604881920\" title=\"View the conversation on Twitter\">641 people are talking about this</a></li>\r\n</ul>\r\n</blockquote>\r\n\r\n<p><a href=\"https://support.twitter.com/articles/20175256\" title=\"Twitter Ads info and privacy\">Twitter Ads info and privacy</a></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Just yesterday, Thomson Reuters unveiled survey results that indicated 205 of financial instituitions may begin cryptocurrency trading this year, underscoring what Fundstrat&rsquo;s Lee is observing as well.</p>\r\n\r\n<blockquote>\r\n<p>&ldquo;More clients are starting to be very serious about how they want to have exposure to this asset class. And so we&rsquo;re having conversations with people you would never think would actually have an interest or want to talk about crypto,&rdquo; said Lee on CNBC.</p>\r\n</blockquote>\r\n\r\n<p>Coinnewsafrica&nbsp;recentlyreported&nbsp;that Goldman Sachs was moving closer to launching a proprietary cryptocurrency trading desk amid the addition of a cryptocurrency trader to spearhead its digital assets platform. Fundstrat&rsquo;s Lee tells CNBC it&rsquo;s a sign that cryptocurrencies are becoming &ldquo;mainstream&rdquo;.</p>\r\n\r\n<p>Fundstrat&rsquo;s Bitcoin Misery Index (BMI) is currently hovering at about 47 after being stuck below 20 earlier this year. The higher the reading on the BMI, the more jubilant traders feel about bitcoin. &ldquo;Historically, as BMI moves up, the bitcoin price usually accelerates,&rdquo; said Lee.</p>\r\n",
  "created": {
    "$date": "2018-04-26T09:56:45.468Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5ae1a7e8f651df0014df0c27"
  },
  "title": "Chilean Anti-Monopoly Court Orders Banks To Re-Open Crypto Exchange’s Accounts",
  "image": "https://i.imgur.com/fktTNQp.jpg",
  "author": "Jerry Ifeanyi",
  "category": "NEWS",
  "intro": "Chilean cryptocurrency exchange Buda has persuaded a court to order the re-opening of its accounts at two major Chilean banks",
  "body": "<p dir=\"ltr\">A Major Chilean cryptocurrency exchange Buda has persuaded a court to order the re-opening of its accounts at two major Chilean banks,&nbsp;<a rel=\"nofollow,noopener\">Bloomberg reports</a>&nbsp;April 25.</p>\r\n\r\n<p dir=\"ltr\">Chile&rsquo;s&nbsp;anti-monopoly court published the ruling on its website, ordering state bank Banco del Estado de Chile and Itau Corpbanca to re-open Buda&rsquo;s accounts while the&nbsp;exchange&rsquo;s&nbsp;lawsuit continues against 10 banks, including the aforementioned two. Buda sued the banks after what it said was an &ldquo;unjustified&rdquo; closing of its accounts.</p>\r\n\r\n<p dir=\"ltr\">Earlier this month, a group of exchanges in Chile filed legal action against the banks&rsquo; decision to shut down their accounts.&nbsp;Buda,&nbsp;Orionx, and&nbsp;CrytpocurrencyMarket&nbsp;say that the&nbsp;banking system&nbsp;has taken unilateral action in Chile that&rsquo;s &ldquo;killing the entire industry.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">In an&nbsp;<a>interview with Cointelegraph</a>, Buda CEO Guillermo Torrealba said that while Chile would like to show itself as open and liberal to new technologies, the veneer is thin:</p>\r\n\r\n<blockquote>\r\n<p dir=\"ltr\">&ldquo;Chile is showing its &quot;B&quot; side, that of being an extremely conservative country, even though we make huge efforts for the world to see us as liberals.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p dir=\"ltr\">According to Torrealba, despite an outcry in the media and on Twitter, banks refuse to respond. He says that the powerful banking sector is making the environment for cryptocurrency worse than Ecuador, Bolivia, or China.</p>\r\n\r\n<p dir=\"ltr\">Torrealba emphasized that there are no laws, rulings, or legislation that prevent crypto firms from operating normally, rather the banking sector has taken on the role of a hegemonic&nbsp;regulator:</p>\r\n\r\n<blockquote>\r\n<p>&ldquo;There hasn&#39;t been one regulator, legislator or government official saying that cryptocurrencies aren&rsquo;t legal, it was just the decision of a very powerful sector of the economy: the banking industry.&rdquo;</p>\r\n</blockquote>\r\n",
  "created": {
    "$date": "2018-04-26T10:20:24.356Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5ae1b3fdf651df0014df0c28"
  },
  "title": "Binance chief Zhao “Denies All” Sequoia Allegations in Hong Kong Lawsuit",
  "image": "https://i.imgur.com/Dt5ccsI.png?1",
  "author": "joseph brown",
  "category": "NEWS",
  "intro": "Binance chief Zhao Changpeng, founder of the world’s largest cryptocurrency exchange, has formally denied allegations",
  "body": "<p>Binance chief Zhao Changpeng, founder of the world&rsquo;s largest cryptocurrency exchange, has formally denied allegations made by venture capital firm Sequoia Capital about a failed funding deal.</p>\r\n\r\n<p>As reported yesterday, a subsidiary of&nbsp;Sequoia Capital China sued Zhao&nbsp;in a Hong Kong lawsuit claiming the crypto exchange founder had violated terms of an exclusivity agreement by holding fundraising talks with other potential investors. It is believed that negotiations between the two parties broke down after Binance shareholders were left unimpressed by Sequoia&rsquo;s valuation of Binance, at a proposed $80 million.</p>\r\n\r\n<p>The dispute became public after Sequoia obtained a temporary injunction, in late December, to keep Zhao from engaging in negotiations with other firms, namely IDG Capital which is reported to have offered two cash injections of $400 million and $1 billion in valuing Binance far higher than Sequoia.</p>\r\n\r\n<p>In a&nbsp;statement&nbsp;on Thursday, Binance confirmed that the &lsquo;ex parte conjunction&rsquo; was obtained without notice to Zhao. However, Zhao challenged the injunction this month and the Hong Kong High court has since dismissed the judicial order.</p>\r\n\r\n<p>Binance revealed:</p>\r\n\r\n<blockquote>\r\n<p>[T]he High Court of Hong Kong has now determined that this injunction should not have been granted, as it had been improperly obtained and constituted an abuse of process by SCC (Sequoia Capital China).</p>\r\n</blockquote>\r\n\r\n<p>&ldquo;Mr. Zhao denies all of SCC&rsquo;s allegations relating to the present dispute,&rdquo; the announcement added, further stating the SCC was ordered by the Hong Kong High Court to pay for Zhao&rsquo;s legal costs in relation to the injunction proceedings.</p>\r\n\r\n<p>The two parties will continue to work on settling the dispute in arbitration,&nbsp;the exchange&nbsp;said.</p>\r\n",
  "created": {
    "$date": "2018-04-26T11:11:57.528Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5aef61a93b94cc001458598f"
  },
  "title": "Japan's Financial Watchdog Sets Out New Requirements For Crypto Exchanges",
  "image": "https://i.imgur.com/Ip9wXyu.jpg",
  "author": "Jerry Ifeanyi",
  "category": "News",
  "intro": "Japan’s financial watchdog, the Financial Services Agency (FSA), has laid out yet further regulatory stipulations for domestic crypto exchanges",
  "body": "<p dir=\"ltr\">Japan&rsquo;s financial watchdog, the Financial Services Agency (FSA), has laid out yet further regulatory stipulations for domestic crypto exchanges, Cointelegraph Japan&nbsp;<a href=\"https://jp.cointelegraph.com/news/japanese-fsa-will-reflesh-crypto-market-rules-nikkei-reported\" rel=\"nofollow\" target=\"_blank\">reports</a>&nbsp;today, May 6.</p>\r\n\r\n<p>The regulator is reportedly intensifying its efforts to prevent a repeat of January&rsquo;s&nbsp;<a href=\"https://cointelegraph.com/news/japan-coincheck-exchange-freezes-all-withdrawals-as-up-to-723-mln-leaves-its-wallet\">$532 mln</a>&nbsp;hack of crypto exchange Coincheck, the&nbsp;<a href=\"https://cointelegraph.com/news/japan-coincheck-exchange-freezes-all-withdrawals-as-up-to-723-mln-leaves-its-wallet\">biggest single exchange hack</a>&nbsp;in the history of the crypto ecosystem.</p>\r\n\r\n<p>As Cointelegraph Japan reports, an FSA source&nbsp;<a href=\"https://asia.nikkei.com/Spotlight/Bitcoin-evolution/Japan-fleshes-out-crypto-market-rules-to-prevent-Coincheck-2.0\" rel=\"nofollow,noopener\" target=\"_blank\">told</a>&nbsp;local news outlet Nikkei Asian Review that identifying potential risks in advance has been a challenge for the watchdog. The source reportedly told Nikkei that &quot;without the necessary know-how, we&#39;ve been feeling our way through the dark on how thoroughly we should check these different aspects.&rdquo;</p>\r\n\r\n<p>The new framework entails investor protection measures and attempts to rehaul exchanges&rsquo; internal management systems.</p>\r\n\r\n<p>According to Nikkei, exchanges will now be required to monitor customer accounts multiple times daily for suspicious fluctuations, manage client assets separately from those of the exchange, and store crypto holdings on offline systems only. They will also face stricter anti-money-laundering (AML) measures, which demand know your customer (KYC) checks, such as ID verification, and multiple-password protection for large transfers.</p>\r\n\r\n<p>The measures notably also&nbsp;<a href=\"https://cointelegraph.com/news/japanese-regulators-discussed-restricting-trade-of-privacy-focused-altcoins-report-says\">confirm</a>&nbsp;that government-registered exchanges will now face tight restrictions &ndash; effectively a ban &ndash; on the trading of anonymity-oriented altcoins, such as&nbsp;<a href=\"https://cointelegraph.com/tags/dash\">Dash</a>(DASH) and&nbsp;<a href=\"https://cointelegraph.com/tags/monero\">Monero</a>&nbsp;(XMR).</p>\r\n\r\n<p>The FSA will send inspectors to both new and existing operators to check compliance with the new measures, Nikkei reports further.</p>\r\n\r\n<p>A new&nbsp;<a href=\"https://cointelegraph.com/news/japan-finally-gets-self-regulatory-body-for-cryptocurrency-exchanges\">self-regulatory body</a>&nbsp;for Japanese exchanges was convened last month to provide assistance to domestic operators, some of whom have&nbsp;<a href=\"https://cointelegraph.com/news/japan-2-bitcoin-exchanges-choose-shutdown-over-regulatory-compliance\">buckled</a>&nbsp;under escalating pressure from the FSA, whose measures have included&nbsp;<a href=\"https://cointelegraph.com/news/japans-financial-regulator-to-conduct-inspections-of-15-unregistered-crypto-exchanges\">on-site flash inspections</a>, temporary suspensions, and&nbsp;<a href=\"https://cointelegraph.com/news/japanese-financial-regulator-issues-punishment-notices-for-7-crypto-exchanges\">penalties</a>. In April, international crypto exchange Kraken&nbsp;<a href=\"https://cointelegraph.com/news/crypto-exchange-kraken-to-end-services-in-japan-cites-rising-costs-of-business\">announced</a>&nbsp;it would be ending its services in Japan, citing rising costs of business.</p>\r\n",
  "created": {
    "$date": "2018-05-06T20:12:25.162Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5aef63383b94cc0014585990"
  },
  "title": "New Head Of South Korean Financial Regulator Notes ‘Positive Aspects’ Of Crypto",
  "image": "https://i.imgur.com/GRsPNH2.png",
  "author": "Jerry Ifeanyi",
  "category": "News",
  "intro": "The newly appointed governor of South Korea’s Financial Supervisory Service (FSS) said that he sees “some positive aspects” to cryptocurrencies",
  "body": "<p dir=\"ltr\">The newly appointed governor of&nbsp;<a href=\"https://cointelegraph.com/tags/south-korea\">South Korea&rsquo;s</a>&nbsp;Financial Supervisory Service (FSS) said that he sees &ldquo;some positive aspects&rdquo; to cryptocurrencies in a press conference today, May 6 according to <a href=\"https://cointelegraph.com/news/new-head-of-south-korean-financial-regulator-notes-positive-aspects-of-crypto\">Cointelegraph.com</a>. The governor also said the FSS will be working on crypto regulatory &ldquo;issues&rdquo; in collaboration with other regulators, local news outlet&nbsp;<a href=\"http://www.koreatimes.co.kr/www/nation/2018/05/367_248526.html\" rel=\"nofollow,noopener\" target=\"_blank\">The Korea Times</a>&nbsp;reports.</p>\r\n\r\n<p>Yoon Suk-heun, who will officially begin work on May 8, said that better crypto regulation &ldquo;would produce&rdquo; the kind of secure financial system that makes crypto-related products more accessible.</p>\r\n\r\n<p>After South Korea&nbsp;<a href=\"https://cointelegraph.com/explained/south-korea-and-crypto-regulations-explained\">banned</a>&nbsp;anonymous trading on domestic crypto exchanges in December of this year,&nbsp;<a href=\"https://cointelegraph.com/news/south-korea-clarifies-position-on-crypto-regulation-amidst-confusion-in-mainstream-media\">rumors circulated</a>&nbsp;that an all-out crypto ban in the country was imminent, a claim&nbsp;<a href=\"https://cointelegraph.com/news/south-korea-finance-minister-confirms-no-ban-on-cryptocurrency\">denied</a>&nbsp;by South Korea&rsquo;s Finance Minister in January.</p>\r\n\r\n<p>Yoon did not answer a question about how the FSS will deal with domestic crypto exchanges, instead replying that &ldquo;there are a lot of issues that need to be addressed and reviewed. We can figure them out but gradually.&rdquo;</p>\r\n\r\n<p>After the non-anonymous trading ban was introduced &ndash; which also banned non-resident foreigners and South Korean citizens under 18 from trading &ndash; the &ldquo;daily transactions of cryptocurrencies plummeted to around 400 billion won from 4 trillion won before the financial regulators implement the new regulation,&quot; VP of South Korean crypto exchange Bithumb Lee Jeong-ah told The Korean Times.</p>\r\n\r\n<p>A spokesperson from South Korean crypto exchange UpBit told The Korean Times that they &ldquo;don&rsquo;t oppose regulations,&rdquo; continuing:</p>\r\n\r\n<blockquote>\r\n<p>&ldquo;But you can&#39;t entirely kill the markets by simply imposing regulations. What the new FSS chief should think about is how the regulators should provide remedies to help crypto trading and blockchain technology get better.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p>In March of this year, South Korean government officials&nbsp;<a href=\"https://cointelegraph.com/news/south-korean-government-bans-officials-from-crypto-holding-and-trading\">were banned</a>&nbsp;from both trading and holding cryptocurrencies. More recently, in one of the first more friendly moves towards the crypto sphere, a group of South Korean lawmakers&nbsp;<a href=\"https://cointelegraph.com/news/south-korean-lawmakers-introduce-bill-to-legalize-new-icos\">introduced a bill</a>&nbsp;to make the domestic launch of&nbsp;<a href=\"https://cointelegraph.com/tags/ico\">Initial Coin Offerings</a>&nbsp;(ICO) legal, albeit supervised strictly by the Ministry of Science and ICT and the Financial Services Commission (FSC), which directs the FSS.</p>\r\n",
  "created": {
    "$date": "2018-05-06T20:19:04.152Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5aef66943b94cc0014585991"
  },
  "title": "Pro-BTC Wall St Analyst Urges Not To Buy Crypto Now, Despite Recent Rally",
  "image": "https://i.imgur.com/uLimFtm.jpg",
  "author": "Jerry Ifeanyi",
  "category": "News",
  "intro": "Nick Colas urged investors to think twice before entering the crypto market",
  "body": "<p dir=\"ltr\">Nick Colas,&nbsp;<a href=\"https://cointelegraph.com/news/pioneering-bitcoin-analyst-nick-colas-is-back-to-put-dots-together\">the first</a>&nbsp;Wall Street brokerage analyst to cover Bitcoin (BTC) extensively, has urged investors to think twice before entering the crypto market, despite the market&rsquo;s recent rally, in an&nbsp;<a href=\"https://www.cnbc.com/video/2018/05/04/first-wall-street-analyst-to-cover-bitcoin-urges-caution.html\" rel=\"nofollow,noopener\" target=\"_blank\">interview</a>&nbsp;with CNBC May 4 according to <a href=\"https://cointelegraph.com/news/pro-btc-wall-st-analyst-urges-not-to-buy-crypto-now-despite-recent-rally\">cointelegraph.com.</a></p>\r\n\r\n<p>Colas has a well established reputation among Wall Street professionals, having authored Convergex&rsquo;s popular Morning Markets Briefing for 14 years. He refuted the idea that in the wake of the market&rsquo;s&nbsp;<a href=\"https://cointelegraph.com/news/crypto-market-sees-around-50-percent-losses-across-the-board-at-end-of-first-quarter-2018\">early year crash</a>, now could be an&nbsp;<a href=\"https://cointelegraph.com/news/crypto-market-hitting-40-trln-in-10-years-definitely-possible-says-pantera-capital-ceo\">opportune moment</a>&nbsp;for investors to get in:</p>\r\n\r\n<blockquote>\r\n<p>&ldquo;A lot of people [are] asking [whether] now [is] the right time to buy, and the short answer is no, for two fundamental reasons. The first is we&rsquo;re not seeing a lot of incremental engagement from people interested in buying Bitcoin for the first time, and like any new technology you need new adopters to come in to make it more valuable. And in terms of Google searches, they are way down from the peaks back in December and January, [by] 85 to 90 percent&hellip;</p>\r\n</blockquote>\r\n\r\n<p>Colas added that he was concerned that there is now relatively little wallet growth, with only 2.2 percent more people opening Bitcoin wallets to purchase the cryptocurrency last month, as opposed to the 5-7 percent monthly growth that was recorded during all of last year.</p>\r\n\r\n<p>When asked whether last year&rsquo;s soaring market valuations were evidence that Bitcoin is indeed a bubble, Colas responded:</p>\r\n\r\n<blockquote>\r\n<p>&ldquo;Certainly in retrospect it was absolutely a bubble based around the&nbsp;<a href=\"https://cointelegraph.com/news/bitcoin-markets-really-like-cboe-futures-prices-spike-sharply\">Futures</a>&nbsp;launch in December &hellip; [I&rsquo;ve covered Bitcoin] since 2013, [I] fundamentally believe in the structure of the technology and the story, but it obviously has huge price volatility around it, and we&rsquo;ve seen that even in the past month with [the market] rallying as much as it has.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p>Colas&rsquo;s circumspect tone as to whether mainstream adoption can become a reality anytime soon sets his argument apart from other crypto investment perspectives, which can often seem hopelessly polarized between either the&nbsp;<a href=\"https://cointelegraph.com/news/buying-bitcoin-is-not-investing-claims-oracle-of-omaha-warren-buffett\">diehard skeptics</a>&nbsp;or the&nbsp;<a href=\"https://cointelegraph.com/news/crypto-hedge-fund-pantera-capital-btc-will-highly-likely-break-20000-this-year\">exuberant</a>&nbsp;Bitcoin&nbsp;<a href=\"https://cointelegraph.com/news/tom-lee-says-btc-will-hit-25000-in-2018-advises-aggressive-buying-at-market-low\">bulls</a></p>\r\n",
  "created": {
    "$date": "2018-05-06T20:33:24.642Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5af2014251ec840014ca9bdb"
  },
  "title": "Bitcoin ABC Patches Critical Vulnerability in Bitcoin Cash Mining Software",
  "image": "https://i.imgur.com/jvScukp.png",
  "author": "Jerry Ifeanyi",
  "category": "News",
  "intro": "Bitcoin abc patches critical vulnerability in bitcoin cash mining software",
  "body": "<p>Cryptocurrency development team Bitcoin ABC has released a patch to address a critical vulnerability in bitcoin cash mining softwareaccording to <a href=\"https://www.ccn.com/bitcoin-abc-patches-critical-vulnerability-in-bitcoin-cash-mining-software/\">CCN.com.</a></p>\r\n\r\n<p>According to Bitcoin ABC&rsquo;s&nbsp;<a href=\"https://www.bitcoinabc.org/2018-05-07-incident-report/\">incident report</a>, the vulnerability would have allowed an attacker to initiate a split in the bitcoin cash network.</p>\r\n\r\n<p>To accomplish this, the attacker would have constructed a malicious transaction that included the bitflag of &ldquo;0x20&rdquo; in the signature hash type. The transaction would have been accepted by Bitcoin-ABC 0.17.0 and mined into a block but rejected by all other bitcoin cash mining software &mdash; including previous versions of Bitcoin-ABC.</p>\r\n\r\n<p><a href=\"http://ccn.com/tag/bitcoin-abc\">Bitcoin ABC</a>&nbsp;was made aware of the vulnerability on April 26, and developers quietly distributed a patch to mining pool operators and &ldquo;verified bitcoin cash miners&rdquo; before disclosing the potential exploit to the general public.</p>\r\n\r\n<p>From the statement:</p>\r\n\r\n<blockquote>\r\n<p>&ldquo;After analysis of the vulnerability and possible responses, Bitcoin-ABC developers prepared a patch for the vulnerability, and a private release, to distribute directly to mining pool operators. Due to the decentralized nature of the mining community it was not possible to reach everyone directly. This release was provided to verified Bitcoin Cash miners to forward to trusted miners once they had upgraded.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p>That patch has now received a general release, so miners using Bitcoin-ABC 0.17.0 are advised to upgrade to Bitcoin-ABC 0.17.1, which closes the attack vector.</p>\r\n\r\n<blockquote>\r\n<p>&ldquo;Bitcoin ABC will be taking several actions in order to prevent such an event from occurring again, as well as reduce the overall response time in the case of emergent issues in the future,&rdquo; the company promised in its statement. &ldquo;Additionally, Bitcoin ABC is in discussions with industry participants to establish a formal bug bounty system.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p>Notably, Bitcoin ABC said that they were alerted to the vulnerability by a &ldquo;clear and professional&rdquo; report from an anonymous tipster, to whom they intend to give a reward if he or she comes forward.</p>\r\n",
  "created": {
    "$date": "2018-05-08T19:57:54.505Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5af202c751ec840014ca9bdc"
  },
  "title": "Software Giant Oracle to Debut Blockchain Platform This Month",
  "image": "https://248qms3nhmvl15d4ne1i4pxl-wpengine.netdna-ssl.com/wp-content/uploads/2018/05/Oracle-760x400.jpg",
  "author": "Jerry Ifeanyi",
  "category": "News",
  "intro": "oracle to debut blockchain software",
  "body": "<p>This month, Oracle Corp will present its platform-as-a-service blockchain product, making it the most recent software company to enter the blockchain industry.</p>\r\n\r\n<p>The company will follow up next month with blockchain based apps, according to Thomas Kurian, the company&rsquo;s president of product development. Kurian said the new product will be compatible with other platforms,&nbsp;according to<a href=\"http:// Bloomberg.com\">&nbsp;Bloomberg.</a></p>\r\n\r\n<p>Oracle is teaming with Banco de Chile to log interbank transactions on Hyperledger, Kurian said.</p>\r\n\r\n<p>The company is also working with Nigeria&rsquo;s government in its efforts to document customs and import duties using blockchain technology.</p>\r\n\r\n<p>Going forward, Oracle plans to solicit pharmaceutical companies which need to track and trace batches of medicine, as a way to alleviate the burdens of product recalls.</p>\r\n\r\n<h1>Software Providers Embrace Blockchain</h1>\r\n\r\n<p>Several software companies have sought to use blockchain technology to simplify processes.</p>\r\n\r\n<p>Amazon Inc.&rsquo;s cloud unit and International Business Machines Corp. have both explored blockchain technology for enterprise uses.</p>\r\n\r\n<p>Amazon Web Services (AWS) has introduced blockchain templates&nbsp;for Ethereum and Hyperledger Fabric, providing a fast and easy way to create and deploy secure blockchain networks with open source frameworks. The AWS templates allow users to deploy Ethereum and Hyperledger frameworks with certified AWS CloudFormation templates. Users can focus on building blockchain applications rather than spending time and energy on the manual setup of their blockchain network.</p>\r\n\r\n<p>Victor Wong, BlockApps CEO, a Microsoft affiliate designed to provide an enterprise blockchain toolkit to help businesses develop new functionalities, in 2015&nbsp;cited Oracle&rsquo;s role as a database provider as a parallel to BlockApp&rsquo;s role&nbsp;providing tools such as smart contracts for businesses to use to create new functionalities.</p>\r\n\r\n<p>Microsoft in 2016&nbsp;partnered with an Ethereum-based startup, ConsenSys, to deliver blockchain as an enterprise solution for clients of its cloud-based Azure service. ConsenSys is an Ethereum-coder collective that will allow enterprise users on Azure to access Ethereum Blockchain-as-a-Service (E BaaS).</p>\r\n\r\n<p>IBM started working on a blockchain project several years ago by forming a unit solely dedicated to the technology with more than 1,500 employees.</p>\r\n\r\n<p>Marc Benioff, CEO of Salesforce.com Inc., said in March he hoped to introduce a blockchain product this fall at its Deamforce conference.</p>\r\n",
  "created": {
    "$date": "2018-05-08T20:04:23.294Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5af2078f51ec840014ca9bdd"
  },
  "title": "Bitcoin Purchases Might be Made Easy, New York Stock Exchange Owner",
  "image": "https://www.indiafilings.com/learn/wp-content/uploads/2016/09/SME-Stock-Exchange-in-India.jpg",
  "author": "Jerry Ifeanyi",
  "category": "News",
  "intro": "New York Stock Exchange Owner Wants To Let Customers Buy Bitcoin",
  "body": "<p dir=\"ltr\">The owner of the New York Stock Exchange (NYSE) is mulling letting customers buy and hold Bitcoin, The New York Times&nbsp;<a href=\"https://www.nytimes.com/2018/05/07/technology/bitcoin-new-york-stock-exchange.html\" rel=\"nofollow,noopener\" target=\"_blank\">reported</a>&nbsp;late Monday, May 7. The move would be the second&nbsp;<a href=\"https://cointelegraph.com/tags/wall-street\">Wall Street</a>&nbsp;giant in a week to reportedly open up to crypto.</p>\r\n\r\n<p>As the New York Times reports, citing &ldquo;emails and documents&rdquo; as well as four anonymous sources, NYSE owner Intercontinental Exchange (ICE) is planning to offer traders contracts that eventually result in customers owning the cryptocurrency.</p>\r\n\r\n<p>The news comes just days after the publication quoted a&nbsp;<a href=\"https://cointelegraph.com/tags/goldman-sachs\">Goldman Sachs</a>&nbsp;executive, who&nbsp;<a href=\"https://cointelegraph.com/news/goldman-sachs-says-bitcoin-is-not-a-fraud-plans-trading\">appeared to confirm</a>&nbsp;the bank would debut Bitcoin futures &ldquo;within weeks&rdquo;.</p>\r\n\r\n<p>ICE &ldquo;has had conversations with other financial institutions about setting up a new operation through which banks can buy a contract, known as a swap, that will end with the customer owning Bitcoin the next day &mdash; with the backing and security of the exchange,&rdquo; the Times wrote late Monday.</p>\r\n\r\n<p>Should the move go ahead, ICE and Goldman would join an increasingly large chunk of traditional finance engaging with cryptocurrency. Other recent players now include&nbsp;<a href=\"https://cointelegraph.com/tags/nasdaq\">NASDAQ</a>, which&nbsp;<a href=\"https://cointelegraph.com/news/nasdaq-ceo-says-company-open-to-becoming-crypto-trading-platform-when-market-matures\">announced</a>&nbsp;it would be &ldquo;open&rdquo; to establishing a cryptocurrency trading platform in future.</p>\r\n\r\n<p>The positions further contrast sharply with contradicting industry perspectives currently hitting the headlines, such as comments from Berkshire Hathaway CEO&nbsp;<a href=\"https://cointelegraph.com/tags/warren-buffett\">Warren Buffett</a>, who this week&nbsp;<a href=\"https://cointelegraph.com/news/ethereum-as-a-security-ico-market-reopening-in-south-korea-and-rat-poison-hodlers-digest-apr-30-may-6\">likened</a>&nbsp;Bitcoin to &ldquo;rat poison.&rdquo;</p>\r\n\r\n<p><a href=\"https://cointelegraph.com/tags/bill-gates\">Bill Gates</a>&nbsp;meanwhile adopted a more curious halfway position,&nbsp;<a href=\"https://cointelegraph.com/news/bill-gates-id-short-crazier-speculative-bitcoin-if-i-could\">telling CNBC</a>&nbsp;yesterday that although trading Bitcoin was a &ldquo;greater fool&rdquo; activity, he would still &ldquo;short it if there was an easy way to do it.&rdquo;</p>\r\n",
  "created": {
    "$date": "2018-05-08T20:24:47.160Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b1a44f9386b140014320835"
  },
  "title": "Prowli Malware Infects Over 40,000 Machines, Which Were Used for Crypto Mining",
  "image": "https://i.imgur.com/bXIspPl.jpg",
  "author": "Elijah ifeanyi ",
  "category": "News",
  "intro": "Security team discovers malicious traffic manipulation",
  "body": "<p dir=\"ltr\">The GuardiCore security team has discovered a malicious traffic manipulation and&nbsp;cryptocurrency&nbsp;mining campaign, according to an announcement&nbsp;published&nbsp;June 6. The campaign infected over 40,000 machines across various industries, including finance, education, and&nbsp;government.</p>\r\n\r\n<p dir=\"ltr\">The campaign called Operation Prowli used various techniques like exploits and password brute-forcing to spread malware and take over devices, such as web servers, modems, and Internet-of-Things (<a href=\"https://cointelegraph.com/tags/internet-of-things\">IoT</a>) devices. GuardiCore found that the attackers behind Prowli were focused on making money rather than ideology or espionage.</p>\r\n\r\n<p dir=\"ltr\">According to the report, the compromised devices were infected with a&nbsp;Monero&nbsp;(XMR) miner and the r2r2 worm, a&nbsp;malware&nbsp;that executes SSH brute-force attacks from the hacked devices, and backs the Prowli to affect new victims. In other words, by randomly generating IP address blocks, r2r2 tries to brute-force SSH logins with a user/ password dictionary, and after breaking in runs a series of commands on the victim. The GuardiCore wrote:</p>\r\n\r\n<blockquote>\r\n<p dir=\"ltr\">&quot;The attacks all behaved in the same fashion, communicating with the same C&amp;C server to download a number of attack tools named r2r2 along with a cryptocurrency miner.&quot;</p>\r\n</blockquote>\r\n\r\n<p dir=\"ltr\">Additionally, cybercrooks used an open source webshell named &ldquo;WSO Web Shell&rdquo; to alter the compromised websites to host malicious code that redirects site visitors to a traffic distribution system, which then redirects them to various other malicious sites. Once redirected to a fake website, users fell victim to clicking on malicious browser extensions. The GuardiCore team reported that Prowli managed to compromise more than 9,000 companies.</p>\r\n\r\n<p>Last month, a new piece of&nbsp;cryptojacking<a href=\"https://cointelegraph.com/news/new-snobbish-cryptojacking-malware-infected-500k-users-in-3-days-report-says\"> </a>malware<a href=\"https://cointelegraph.com/news/new-snobbish-cryptojacking-malware-infected-500k-users-in-3-days-report-says\"> </a>used<a href=\"https://cointelegraph.com/news/new-snobbish-cryptojacking-malware-infected-500k-users-in-3-days-report-says\"> </a>half a million<a href=\"https://cointelegraph.com/news/new-snobbish-cryptojacking-malware-infected-500k-users-in-3-days-report-says\"> </a>computers&nbsp;to mine 133 Monero tokens in three days. Cyber security firm 360 Total Security discovered that the malware, referred to as WinstarNssmMiner, presents a fresh challenge to users, due to its ability to both mine and crash infected machines.</p>\r\n",
  "created": {
    "$date": "2018-06-08T08:57:29.248Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b32d82629c950001468bd18"
  },
  "title": "Facebook Backtracks On Cryptocurrency Ads Ban",
  "image": "https://i.imgur.com/dscnpMQ.jpg",
  "author": "lee simon",
  "category": "News",
  "intro": "On june 26 facebook updated its policy allowing cryptocurrencies to once again be advertised on its platform, while retaining it stance on initial coin offering (ICOs) .",
  "body": "<p dir=\"ltr\">On june 26 facebook updated its policy allowing cryptocurrencies to once again be advertised on its platform, while retaining it stance on initial coin offering (ICOs)&nbsp;.</p>\r\n\r\n<p>Today&rsquo;s announcement says the company has been looking into the best way of &ldquo;refining&rdquo; its blanket ban on cryptocurrency-related advertising &ldquo;over the last few months,&rdquo; in order to &ldquo;allow some ads while also working to ensure that they&rsquo;re safe.&rdquo; &nbsp;</p>\r\n\r\n<p>Facebook&#39;s revised &quot;prohibited products and services policy&quot; now states:</p>\r\n\r\n<blockquote>\r\n<p>&ldquo;Starting June 26, we&rsquo;ll [...] allow ads that promote cryptocurrency and related content from pre-approved advertisers. But we&rsquo;ll continue to prohibit ads that promote binary options and initial coin offerings.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p>The newly updated policy requires advertisers wanting to run ads for cryptocurrency products and services to submit an&nbsp;application&nbsp;to allow Facebook to assess their eligibility. Applicants are instructed to include &ldquo;any licenses they have obtained, whether they are traded on a public stock exchange, and other relevant public background on their business.&rdquo;</p>\r\n\r\n<p>Given these restrictions, Facebook concedes that &ldquo;not everyone who wants to advertise will be able to do so.&rdquo; The company says it will listen to feedback and &ldquo;if necessary&rdquo; revise its policy over time. It also states it will continue to &ldquo;study&rdquo; the technology underpinning cryptocurrencies as it continues to develop its policy.</p>\r\n\r\n<p>Facebook first&nbsp;introduced&nbsp;its&nbsp;ban&nbsp;in January 2018, which it said was designed to prevent &ldquo;ads that promote financial products and services that are frequently associated with misleading or deceptive promotional practices.&rdquo;</p>\r\n\r\n<p>At the time, Facebook stressed that its initial policy was &ldquo;intentionally broad,&rdquo; to allow the company time to home measures to detect and prevent unscrupulous promoters.</p>\r\n",
  "created": {
    "$date": "2018-06-27T00:19:50.289Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b32e2b129c950001468bd19"
  },
  "title": " China Bank Files Patent for Digital Currency Wallet",
  "image": "https://i.imgur.com/6U5qong.jpg",
  "author": "brown chuks",
  "category": "News",
  "intro": " Digital Currency Research Lab at the People’s Bank of China(PBoC) has filed a new patent this week for a digital wallet",
  "body": "<p dir=\"ltr\">&nbsp;Digital Currency Research Lab at the People&rsquo;s Bank of China(PBoC) has filed a new patent this week for a digital wallet that would allow users to track their transaction histories. The patent&nbsp;application&nbsp;was submitted with China&#39;s State Intellectual Property Office (SIPO) Friday, June 22.</p>\r\n\r\n<p>The new patent outlines how the proposed digital wallet could be used to track transaction data in coordination with a centralized digital currency issuance registration agency. The wallet would enable multi-signature security and manage digital assets that are encrypted - as existing cryptocurrencies - with private keys.</p>\r\n\r\n<p>Transaction queries would yield results including the digital currency type, amount, source currency, as well as identification of the source and destination wallets.</p>\r\n\r\n<p>This week&rsquo;s new patent is a part of a longer-term vision for&nbsp;blockchain&nbsp;integration pursued by China&rsquo;s central bank. While the government maintains a&nbsp;hardline&nbsp;stance on decentralized cryptocurrencies such as Bitcoin (BTC), the PBoC has been extensively investigating the benefits of harnessing their underlying technology for the existing financial system.</p>\r\n\r\n<p>The Governor of the PBoC, Zhou Xiaochuan, has&nbsp;suggested&nbsp;that digital currencies will ultimately diminish cash circulation and are &ldquo;technologically inevitable,&rdquo; while stressing the PBoC&rsquo;s role in controlling the &ldquo;unpredictable effects&rdquo; of certain applications of blockchain.&nbsp;</p>\r\n\r\n<p>In April, the director of PBoC&rsquo;s Digital Currency Research Lab, Yao Qian,&nbsp;wrote&nbsp;a likewise cautiously affirmative opinion piece for Chinese media advocating for many of blockchain&rsquo;s potential benefits, while arguing for the need to temper its decentralization in certain scenarios.</p>\r\n\r\n<p>Just this month, the PBoC has revealed a new blockchain-powered system with&nbsp;smart contractfunctionality designed to tokenize paper checks.</p>\r\n\r\n<p>Beyond PBoC, in 2017 China as a whole was reported to have&nbsp;filed&nbsp;more blockchain tech patents than any other country with the World Intellectual Property Organization (WIPO).People&rsquo;s Bank of China Files Patent for Digital Currency Wallet.</p>\r\n",
  "created": {
    "$date": "2018-06-27T01:04:49.191Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b336d225647190014d76e00"
  },
  "title": "  Swiss Bankers Association (SBA)  create a working group to help blockchain companies open bank accounts,",
  "image": "https://i.imgur.com/yZVmqtE.png",
  "author": "lee simon",
  "category": "News",
  "intro": " Swiss Bankers Association (SBA)  create a working group to help blockchain companies open bank account",
  "body": "<p dir=\"ltr\">The Financial Director of Zug,&nbsp;Switzerland, Heinz T&auml;nnler called on the Swiss Bankers Association (SBA) to create a working group to help blockchain companies open&nbsp;bank&nbsp;accounts, local news outlet cash.ch&nbsp;<a href=\"https://www.cash.ch/news/top-news/digitalisierung-zuger-finanzdirektor-will-blockchain-firmen-zu-bankkonten-verhelfen-1185646\" rel=\"nofollow,noopener\" target=\"_blank\">reported</a>&nbsp;June 26.</p>\r\n\r\n<p>blockchain&nbsp;and&nbsp;crypto&nbsp;companies&nbsp; are&nbsp;&nbsp;faceing difficulties with opening bank accounts in the country, T&auml;nnler together with the Financial Director of Zurich Ernst Stocker brought the issue to the attention of Federal Council Ueli Maurer. T&auml;nnler is reportedly concerned about the risk of losing business to countries with more friendly banking conditions for blockchain companies.</p>\r\n\r\n<p>T&auml;nnler said that blockchain offers great potential for Switzerland, stating that &quot;it must not be that Switzerland loses an innovative industry because it makes payment transactions impossible.&quot; Maurer subsequently called a meeting with representatives of the Swiss National Bank (SNB), the State Secretariat for International Financial Affairs (SIF), the Swiss Financial Market Supervisory Authority (FINMA), the SBA, Hypothekarbank Lenzburg, and the cantons of Zurich and Zug.</p>\r\n\r\n<p>As a result, a working group headed by the SBA has been established, which is charged to develop recommendations for banks on how to deal with local blockchain companies in order to open an account. The recommendations will also be consolidated with FINMA.</p>\r\n\r\n<p>According to cash.ch, the Tax Directorate of the Canton of Zug issued a statement saying that the reason for the lack of legal certainty from banks lies in the necessity of compliance with all financial market regulations, especially with&nbsp;money laundering. Per the statement, existing financial market regulations are not tailored to blockchain-based companies.</p>\r\n\r\n<p>Earlier this month, Hypothekarbank Lenzburg&nbsp;became the first bank&nbsp;in Switzerland to provide business accounts to blockchain and crypto companies. While&nbsp;Falcon Private Bank&nbsp;has provided crypto asset management services since last year, the bank&rsquo;s CEO confirmed that they are first in the country to open company accounts for blockchain and crypto companies.&nbsp;</p>\r\n\r\n<p dir=\"ltr\">In May, the decision of Polish banks not to cooperate with&nbsp;BitBay, the largest cryptocurrency exchange in&nbsp;Poland, forced the company to&nbsp;suspend its activities&nbsp;in the country. The exchange announced it would reopen with a new supplier in the jurisdiction of the Republic of&nbsp;Malta, where local laws are more lenient with crypto-business.</p>\r\n",
  "created": {
    "$date": "2018-06-27T10:55:30.493Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b3371535647190014d76e01"
  },
  "title": "NASDAQ: Only Five Percent of Stock Market IT Providers Have Deployed Blockchain Yet",
  "image": "https://i.imgur.com/kX2CNVY.jpg",
  "author": "james bright",
  "category": "News",
  "intro": "Only Five Percent of Stock Market IT Providers Have Deployed Blockchain Yet",
  "body": "<p dir=\"ltr\">IT providers for stock&nbsp;markets&nbsp;and exchanges have been slow to adoption of&nbsp;blockchain&nbsp;technology,&nbsp;Nasdaq&nbsp;told&nbsp;<a href=\"https://blogs.wsj.com/cio/2018/06/26/stock-exchange-tech-providers-slow-to-embrace-blockchain/\" rel=\"nofollow,noopener\" target=\"_blank\">The Wall Street Journal</a>&nbsp;on&nbsp;June 26.</p>\r\n\r\n<p>According to a study commissioned by Nasdaq and carried out by financial and technology research firm&nbsp;Celent, the majority of stock-infrastructure suppliers globally are still in the very early stages of exploring benefits of distributed ledger technology (DLT).</p>\r\n\r\n<p>The report says that only five percent of firms polled have implemented blockchain in some form, compared with 40 percent already using cloud computing, 70 percent deploying robotic process automation, and 35 percent providing artificial intelligence (AI) solutions.</p>\r\n\r\n<p dir=\"ltr\">Despite 70 percent of IT providers claimed they are developing trial projects, 20 percent of respondents stated they have &ldquo;no plans&rdquo; to work on it, another five stated that they lacked expert knowledge on the subject.</p>\r\n\r\n<p>The study polled chief information officers, chief technology officers, and other senior technology leaders at 20 leading market infrastructure firms around the world.</p>\r\n\r\n<p>According to&nbsp;<a href=\"https://blogs.wsj.com/cio/2018/02/06/business-interest-in-blockchain-picks-up-while-cryptocurrency-causes-conniptions/\" rel=\"nofollow,noopener\" target=\"_blank\">International Data Corp</a>. the estimated amount of funds to be spent on blockchain adoption worldwide is around $2.1 billion in 2018, up from $945 million in 2017.</p>\r\n\r\n<p>According to the authors of the study, Arin Ray, a senior analyst at Celent, and Jos&eacute;phine de Chazournes, before applying the new technology, market-infrastructure providers first need to be sure that blockchain technology will provide enough scalability, security, and speed. The authors say these factors, in addition to regulatory compliance, are necessary for the technology to be deployed in today&rsquo;s markets.</p>\r\n\r\n<p>Ray stressed that adoption of blockchain &ldquo;within core market infrastructure operations can take time.&rdquo; De Chazournes added that it can be &ldquo;extremely difficult&rdquo; for all stakeholders to develop a blockchain-powered project that would replace an existing system, particularly within an international exchange.</p>\r\n\r\n<p dir=\"ltr\">Last week, the CEO of Spanish bank BBVA&nbsp;claimed&nbsp;that blockchain technology is &ldquo;not mature&rdquo; and faces major problems, such as &ldquo;volatility of underlying currencies&rdquo; and possible compatibility issues with tax authorities and financial regulators.</p>\r\n\r\n<p>Earlier in May, First Deputy Governor of the Russian Central Bank Olga Skorobogatova&nbsp;similarly critiqued&nbsp;blockchain, claiming that the technology is not yet &ldquo;mature&rdquo; enough for industrial-scale use. &ldquo;Technology for the sake of technology is pointless,&rdquo; she stressed that the international community should first come up with a &ldquo;pragmatic understanding&rdquo; of blockchain&rsquo;s benefits.</p>\r\n",
  "created": {
    "$date": "2018-06-27T11:13:23.634Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b34187b5647190014d76e02"
  },
  "title": "   Larimer CTO Of EOS Proposed To Rewrite Current Constituition",
  "image": "https://i.imgur.com/ERYAiEW.jpg",
  "author": "james bright",
  "category": "News",
  "intro": " (CTO) of EOS Dan Larimer has proposed to rewrite the project’s existing constitution to limit arbitrators’",
  "body": "<p dir=\"ltr\">&nbsp;(CTO) of EOS&nbsp;Dan Larimer has proposed to rewrite&nbsp;the project&rsquo;s existing constitution to limit&nbsp;arbitrators&rsquo; powers, in an EOSGov Telegram&nbsp;chattoday, June 27.</p>\r\n\r\n<p dir=\"ltr\">Larimer&rsquo;s proposal comes in response to recent storm&nbsp;surrounding the structure of governance on the EOS blockchain, in which three distinct groups work to &lsquo;keep one another in check,&rsquo; as defined by the project&rsquo;s &nbsp;constitution.</p>\r\n\r\n<p dir=\"ltr\">These three groups in the EOS ecosystem are the so-called Block Producers (BPs) &ndash; the equivalent of miners on the&nbsp;Bitcoin&nbsp;(BTC) blockchain &ndash; the arbitrators (EOS Core Arbitration Forum (ECAF)) and Token-Holders.</p>\r\n\r\n<p dir=\"ltr\">The ECAF in particular has drawn criticism over the reportedly opaque nature of its&nbsp;role and powers, thrown into relief by a series of errors&nbsp;that have occurred since the&nbsp;EOS mainnet&nbsp;&nbsp;went&nbsp;live&nbsp;on June 15.</p>\r\n\r\n<p dir=\"ltr\">In the recent Telegram discussion, Larimer&nbsp;argued&nbsp;that &ldquo;forcing people into an unknown arbitration system for undefined reasons is a fast way to cause people to run.</p>\r\n\r\n<p dir=\"ltr\">Larimer proposed&nbsp;that arbitrators&rsquo; role should be limited to cases where there is a &ldquo;strong foundation with very clear and defined failure points that can be arbitrated&rdquo; &ndash; in his&nbsp;opinion, only where there is a &ldquo;code - intent mismatch.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">June&rsquo;s arbitration mishaps have caused an outcry from prominent crypto industry members, including&nbsp;Charlie Shrem&nbsp;and&nbsp;Nick Szabo.</p>\r\n\r\n<p dir=\"ltr\">&nbsp;recent incident saw the Block Producers reportedly&nbsp;receive&nbsp;an emergency ECAF order to refuse to process transactions for 27 accounts &ndash; &ldquo;pending further review of the claims by an Arbitrator,&rdquo; with the &ldquo;logic and reasoning&rdquo; for the order to be posted at a later date.</p>\r\n\r\n<p dir=\"ltr\">On June 24, EOS BP New York&nbsp;said&nbsp;it could not &ldquo;with confidence execute any subsequent statements claiming to be a valid ECAF opinion,&rdquo; after a further &ndash; apparently fake &ndash; ECAF order had been issued.</p>\r\n\r\n<p dir=\"ltr\">As Dogecoin creator, Jackson Palmer,&nbsp;remarked&nbsp;on Twitter yesterday, Larimer is effectively today suggesting to &ldquo;scrap[...] the entire [EOS] &lsquo;constitution&rsquo; and start[...] over.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">Crypto persona WhalePanda&nbsp;said&nbsp;the proposal was basically &ldquo;a similar governance model like $ETH&nbsp;where the foundation bails out big losses/hacks/DAO-ish events... but more centralized.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">EOS which is regerded as the 5th largest cryptocurrency by coinmarketcap has face technical issues since the initial launch of mainnet</p>\r\n",
  "created": {
    "$date": "2018-06-27T23:06:35.130Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b341da15647190014d76e03"
  },
  "title": " Securities Regulators In ''Hong Kong'' Promises to Watch The Cryptocurrency Sector",
  "image": "https://i.imgur.com/X4SmJsP.png?1",
  "author": "skrill mandala",
  "category": "News",
  "intro": "Securities and Futures Commission (SFC) says that they will “keep a close watch” on crypto and Initial Coin Offerings(ICO).",
  "body": "<p dir=\"ltr\">&nbsp;Securities and Futures Commission (SFC) says that they will &ldquo;keep a close watch&rdquo; on crypto and&nbsp;Initial Coin Offerings(ICO).</p>\r\n\r\n<p dir=\"ltr\">The SFC notes that since new technologies &ldquo;come with risks,&rdquo; they will be looking&nbsp;at crypto and ICOs and &ldquo;intervening when appropriate.&rdquo; The report states that the SFC took regulatory action against crypto exchanges and ICO issuers in Hong Kong this year, and released two public warning to investors about the risk of investing in crypto.</p>\r\n\r\n<p dir=\"ltr\">The SFC report also includes the agency&rsquo;s supportive actions in the crypto sphere, highlighting the launch of the SFC regulatory sandbox that allows &ldquo;qualified firms to conduct regulated activities utilising financial technologies.&rdquo; The SFC also reports it is working with the Investor Education Center to release educational materials on crypto, as well as public campaigns about the &ldquo;risks associated with ICOs and cryptocurrencies.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">The SFC&rsquo;s first statement and circular on ICOs was released in&nbsp;September 2017, with a second circular published in December 2017 on the regulatory requirements for cryptocurrency operators. The SFC issued another statement in&nbsp;February&nbsp;after taking action against crypto-related firms.</p>\r\n\r\n<p>At the beginning of May, a Hong Kong government report&nbsp;said&nbsp;that virtual currencies like&nbsp;Bitcoin(BTC) are not particularly involved in either money laundering or terrorism financing.</p>\r\n",
  "created": {
    "$date": "2018-06-27T23:28:33.173Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b3ab95c31fdea0014023c79"
  },
  "title": "Coinbase Announce Official Opening Of \"custody\" For Instituitional Investors",
  "image": "https://i.imgur.com/W7m5cnw.jpg",
  "author": "brown chuks",
  "category": "News",
  "intro": "One of the largest crypto exchange  and wallet provider located in u.s Coinbase ",
  "body": "<p dir=\"ltr\">One of the largest crypto exchange &nbsp;and wallet provider located in u.s&nbsp;Coinbase&nbsp;has announced that its digital assets custodian solution for institutional investors is now launched.</p>\r\n\r\n<p dir=\"ltr\">Coinbase first&nbsp;revealed&nbsp;its plans for its &lsquo;Coinbase Custody&rsquo; last year&nbsp;, saying at the time that it was trying&nbsp;to address what it considers to be the &ldquo;number one&rdquo; concern of institutional investors, namely, security.</p>\r\n\r\n<p dir=\"ltr\">&nbsp;Coinbase has already been storing over $20 billion worth of clients&rsquo; crypto over the past six years, but its new custody offering will notably be secured through an SEC-compliant and FINRA-member independent broker-dealer,&nbsp;Electronic Transaction Clearing&nbsp;(ETC).</p>\r\n\r\n<p dir=\"ltr\">The move thus explicitly targets institutions&rsquo; concerns to abide by terms set by U.S. regulator, the&nbsp;Securities and Exchange Commission&nbsp;(SEC), as well as Wall Street&rsquo;s Financial Industry Regulatory Authority (FINRA).</p>\r\n\r\n<p dir=\"ltr\">Today&rsquo;s launch means that institutions from both the US and Europe can now store their crypto assets with Coinbase Custody, which currently supports&nbsp;Bitcoin&nbsp;(BTC),&nbsp;Ethereum&nbsp;(ETH),&nbsp;Litecoin(LTC) and&nbsp;Bitcoin Cash&nbsp;(BCH). Coinbase says it plans to continue adding support for more assets, as well as to open its service to Asian institutions, &ldquo;by the end of the year.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">The company says that Coinbase Custody will employ a range of security measures, including &ldquo;on-chain segregation of crypto assets,&rdquo; &ldquo;offline, multi-sig and geographically distributed transaction protection&rdquo; as well as &ldquo;robust cold storage auditing and reporting.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">Alongside cold storage, reportedly pending regulatory notifications, the company plans to add &ldquo;secure, segregated hot wallets&rdquo; and scheduled withdrawals to increase flexibility.</p>\r\n\r\n<p dir=\"ltr\">Notably, today&rsquo;s post suggests that Coinbase is planning to enable its new institutional clients to &ldquo;to participate in the crypto ecosystem through&nbsp;proof of stake&nbsp;and distributed governance,&rdquo; although further details of these plans are not outlined.</p>\r\n\r\n<p dir=\"ltr\">Coinbase Custody is the first to launch out of a suite of new products&nbsp;revealed&nbsp;by Coinbase in May, which it has said could &ldquo;unlock $10 billion of institutional investor money sitting on the sideline.&rdquo;&nbsp;&nbsp;</p>\r\n\r\n<p dir=\"ltr\">Coinbase is&nbsp; attempting to become a fully SEC-regulated broker dealer itself via its recent&nbsp;acquisition&nbsp;of a financial services firm, as well as hoping to have&nbsp;its own&nbsp;federal banking license.</p>\r\n\r\n<p dir=\"ltr\">In mid-June, Coinbase&rsquo;s Index Fund&nbsp;opened&nbsp;to large-scale, U.S. resident &ldquo;accredited&rdquo; investors, for investments of between $250,000 and $20 million.</p>\r\n\r\n<p>Coinbase has also recently&nbsp;revealed&nbsp;plans to widen its user base to the Japanese crypto market which is a huge one.</p>\r\n",
  "created": {
    "$date": "2018-07-02T23:46:36.821Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b3abd1b31fdea0014023c7a"
  },
  "title": "Digital Currency Marked As Fallacy By Finland Bank",
  "image": "https://i.imgur.com/r7VMISF.jpg?1",
  "author": "james bright",
  "category": "News",
  "intro": " Finland bank released a paper on June 21 titled “The Great Illusion of Cryptocurrencies",
  "body": "<p dir=\"ltr\">&nbsp;Finland bank&nbsp;released a paper on June 21 titled &ldquo;The Great Illusion of Cryptocurrencies,&rdquo; explaining why they think the concept of a digital currency is a &ldquo;fallacy.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">The paper, written by Aleksi Grym, Adviser on Digitalization and Head of the Digital Central Bank process in the Financial Stability and Statistics Department. It aims to explain how cryptocurrencies&rsquo; fundamental nature &ldquo;shows how poorly understood the concept of money itself still is today&rdquo; and how the Internet and social media have &ldquo;muddled our sense of fact and fiction.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">In Grym&rsquo;s words, cryptocurrencies are not real currencies but instead &ldquo;accounting systems for non-existent assets.&rdquo; He makes the argument that digital ledger technologies, like&nbsp;blockchain, are actually the same as other record keeping systems, but that their implementation for crypto is &ldquo;unrelated to the fundamental characteristics of money:&rdquo;</p>\r\n\r\n<blockquote>\r\n<p dir=\"ltr\">&ldquo;For all intents and purposes, that ledger is a centralised ledger. The fact that there are multiple synchronised copies of it, distributed across a network, is irrelevant, as each one has the same data.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p dir=\"ltr\">The article cites several studies on&nbsp;Bitcoin&nbsp;(BTC) and cryptocurrencies with relatively negative views on crypto as either a speculative instrument or a bubble whose &ldquo;fundamental value is zero.&rdquo; Grym also discredits the idea of a central bank issued digital currency, noting that it would &ldquo;practically mean bank accounts at the central bank.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">According to the article, the main reason&nbsp;for buying cryptocurrencies are either for criminal activities, creating a sense of community, security against &ldquo;real or imagined&rdquo; state oppression, and the thrill of trading. Grym then compares buying Bitcoin to the &ldquo;intangible value&rdquo; for some customers that buy &ldquo;toys, fashion, art, club memberships, or firearms.&rdquo;</p>\r\n\r\n<p>&nbsp;</p>\r\n",
  "created": {
    "$date": "2018-07-03T00:02:35.463Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b3b42d96eba430014ec7046"
  },
  "title": "Over 2 Million Bitcoin Addresses targeted By Malware That Steals Window Clipboard ",
  "image": "https://i.imgur.com/rp0eQAw.jpg",
  "author": "lee simon",
  "category": "News",
  "intro": " Millions of Bitcoin Addresses targeted By Malware That Steals Window Clipboard",
  "body": "<p dir=\"ltr\">Anew attack dicovered on&nbsp;Bitcoin&nbsp;users which gains control of Windows clipboard to swap out addresses is already targeting over&nbsp;2&nbsp;million users, this waas reported on 30 june.</p>\r\n\r\n<p dir=\"ltr\">This attack is known as malware which is known to be part of a&nbsp;family of threats known as &ldquo;clipboard hijackers,&rdquo; secretly gains control of memory, which will run&nbsp;in the background to ensure users do not notice its presence. It then replaces the Bitcoin address that the user has copied into the clipboard with the address of the attacker, which the user later unknowingly pastes and sends coin to.</p>\r\n\r\n<p dir=\"ltr\">&ldquo;Unless a user double-checks the address copied, they will have no idea as how quick this swap took place,&rdquo; Bleeping Computer&nbsp;notes, adding an explanatory video about how the malware works.</p>\r\n\r\n<p dir=\"ltr\">Bitcoin users face a variety of vulnerabilities when using hardware to transact, regardless whether this is an&nbsp;Android&nbsp;smartphone, Windows PC or other device.</p>\r\n\r\n<p dir=\"ltr\">&ldquo;Attackers recognize that users are copying and pasting the addresses and have created malware to take advantage of this,&rdquo; Bleeping Computer adds.</p>\r\n\r\n<p dir=\"ltr\">Keeping up-to-date antivirus software running constitutes users&rsquo; main defence against the problem, along with double-checking the destination Bitcoin address of a transaction if this has been entered using a copy-paste function.</p>\r\n\r\n<p>Some&nbsp;hardware wallets&nbsp;such as TREZOR additionally force users to double-check addresses for manipulations whenever a user generates one.</p>\r\n",
  "created": {
    "$date": "2018-07-03T09:33:13.184Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b3df9ba3a08690014987dbc"
  },
  "title": "Top Indian Exchange \"Zebpay\" Closes Fiat Deposit AsCrypto Banking Ban Closes In",
  "image": "https://i.imgur.com/IwzyR7t.jpg",
  "author": "James Bright",
  "category": "News",
  "intro": "\"Zebpay\" Closes Fiat Deposit As Crypto Banking Ban Closes In",
  "body": "<p dir=\"ltr\">India top exchange &#39;Zebpay&#39; closes ruppee deposit and&nbsp;withdrawal as the crypto banking ban hovers around, this was reported july 4</p>\r\n\r\n<p>In a warning statement, Zebpay said current events were &ldquo;beyond its control,&rdquo; having previously warned users that rupee deposits and withdrawals &ldquo;could&rdquo; stop if the ruling from the Reserve Bank of India (RBI) went ahead.</p>\r\n\r\n<p>&ldquo;INR deposits and withdrawals have been paused in the Zebpay app until banks allow us again,&rdquo; an update to the original warning reads.</p>\r\n\r\n<p>On Tuesday, India&rsquo;s Supreme Court&nbsp;upheld&nbsp;the ban deadline, declining to grant an extended grace period to cryptocurrency businesses which rely on banking connections to serve customers.</p>\r\n\r\n<p>The decision means the July 5 deadline still holds, while the Supreme Court confirmed it will hear a petition against the ban July 20.</p>\r\n\r\n<p>Since the plan was formally issued April 6, some businesses have sought alternative means of providing fiat support, fellow exchange WazirX&nbsp;revealing&nbsp;it would transform into a P2P platform so that no in-house conversion between crypto and fiat would be necessary.</p>\r\n\r\n<p>&ldquo;If banking is something the exchanges are not allowed to do, then the solution is something that direct banking doesn&rsquo;t come in,&rdquo; CEO Nischal Shetty told local news outlet Economic Times.</p>\r\n\r\n<p>Zebpay had previously struck a confident tone in the face of the ongoing uncertainty surrounding cryptocurrency in India.</p>\r\n\r\n<p>During his recent interview, co-founder Sandeep Goenka said he &ldquo;welcomed&rdquo; government proposals to crack down on illegal activity, calling for a joint effort to stabilize the local economy.</p>\r\n\r\n<p>&ldquo;We encourage the government to work with our members, as we are committed to detect, report, and eliminate suspicious transactions in pretty much the same way as other institutions do,&rdquo; he commented.</p>\r\n",
  "created": {
    "$date": "2018-07-05T10:58:02.087Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b4190661174690014e310cd"
  },
  "title": "Huobi Launches Cryptocurrency platform in Australia.",
  "image": "https://i.imgur.com/dvbuTeq.jpg",
  "author": "Jerry Ifeanyi",
  "category": "News",
  "intro": "Huobi move to Australia opens door to Africa",
  "body": "<p>Chinese cryptocurrency exchange&nbsp;Huobi&nbsp;which is one of the top five biggest and most secured exchange announced this week that trading has begun on its newly-launched platform in Australia.</p>\r\n\r\n<p>Huobi&rsquo;s global push &nbsp;to be and stay the most used cryptocurrency exchanges in the world will become a reality in the nearest future. The exchange &mdash; now based out of Singapore, with offices in&nbsp;Canada&nbsp;and&nbsp;Brazil&nbsp;&mdash; said trading will start with ten pairs exchanged for the Australian dollar. These pairs include bitcoin, ethereum, litecoin, and bitcoin cash.</p>\r\n\r\n<p>The exchange advised users to be patient as it launches &ldquo;more trading pairs to all users&rdquo; in the future.</p>\r\n\r\n<p>While speaking on the company&rsquo;s move to yet another new continent, &nbsp;According to CCN, the CEO of Huobi Australia Adrian Harrison. said he is well aware of the interests of Australian investors, who tend to be quite informed and &ldquo;sophisticated.&rdquo;</p>\r\n\r\n<p>He said:</p>\r\n\r\n<p>&ldquo;Crypto-traders in Australia are increasingly knowledgeable and sophisticated, matched by a receptive regulator with interest in safely developing the market.&rdquo;</p>\r\n\r\n<p>Huobi is also taking steps to contribute to the growing blockchain space in Australia. Per reports on&nbsp;Finder Australia, the company will use its $200 million Global Ecosystem Fund and its consulting service to &ldquo;partner with the growing numbers of Australian blockchain projects&rdquo; who are looking to expand in the Australian market.</p>\r\n\r\n<p>Huobi has also partnered with Blockchain Global to develop and foster the adoption of cryptocurrencies to Australians and the world at large, and Blockchain Global CEO Sam Lee said that his company&rsquo;s partnership with Huobi is a win-win for the country&rsquo;s blockchain space. With the fast development and adoption of the blockchain technology in Africa, Huobi is predicted to open an exchange in Africa before the end of 2020.</p>\r\n",
  "created": {
    "$date": "2018-07-08T04:17:42.079Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b4195491174690014e310ce"
  },
  "title": "British MP Says Blockchain Technology Can Save UK £8 Billion  parliament",
  "image": "https://i.imgur.com/Xiho2Uz.jpg",
  "author": "Mane Harrison",
  "category": "News",
  "intro": "British increased involvement in the Blockchain technology.",
  "body": "<p><span>C</span>onservative member of the British Parliament Eddie Hughes has said that the British government needs a Chief Blockchain Officer to enable social freedom, increase efficiency and rebuild societal trust.</p>\r\n\r\n<p>In a report issued today entitled &lsquo;Unlocking Blockchain,&rsquo; MP Hughes &nbsp;made a number of other recommendations including an international blockchain competition to encourage talented blockchain developers and proposed a UK blockchain developmental target described as &ldquo;a longterm aim for government departments to make a 1 percent efficiency by embracing blockchain and other associated technologies.&rdquo;</p>\r\n\r\n<p>The 1 percent saving would amount to &pound;8 billion or $10.5 billion and would be achieved by the chief officer overseeing the application of blockchain technology to UK public services databases.</p>\r\n\r\n<p><br>\r\n&nbsp;<br>\r\nThe report was published by Freer, a think-tank connected with the British Tory conservative party, and suggests that businesses standing to benefit from increased adoption of blockchain technology could fund the international blockchain competition and benefit both themselves and the national economy as a whole.</p>\r\n\r\n<p>It also discusses what Hughes calls a &ldquo;trust deficit,&rdquo; a lack of public trust in government institutions created after the 2008 financial crisis and &ldquo;a series of serious public scandals ranging from the illegal misuse of parliamentary expense accounts to claims of harassment and abuse against charity workers.&rdquo;</p>\r\n\r\n<p>&ldquo;After a never-ending litany of betrayals of trust and instances of overreach, the political and financial establishments, companies, and voluntary organisations that were once seen as pillars of the community, are often now held in little more than near contempt by citizens&rdquo;</p>\r\n\r\n<p>Hughes identifies DLT and blockchain technology as a way in which the government can increase transparency in government institutions and grow public faith and trust once more.</p>\r\n\r\n<p>&ldquo;Blockchain provides traceability and clear provenance. The blockchain holds all of the data from the start of the transaction, so the full history of any asset that is on the ledger can be known. There is no need to audit vast amounts of data, as the blockchain itself is the audit trail.&rdquo;</p>\r\n\r\n<p>Fintech</p>\r\n\r\n<p>Hughes goes on to discuss the other applications of blockchain technology, stating that the retail industry had explored and positively identified the capacity to greatly increase operational efficiency through the automation of labor-intensive processes with 82 percent of retail professionals sharing that sentiment in a global survey.</p>\r\n\r\n<p><br>\r\n&nbsp;<br>\r\nHe then cited a Santander Fintech report stating that banks could greatly reduce costs associated with cross-border payments, regulatory compliance, and securities trading through the application of DLT with a cost reduction of up to $20 billion by 2022. Sweden is predicted to save $100 million through the use of the technology in their national land registry by automating the processes involved in fraud prevention.</p>\r\n\r\n<p>The report also details the environmental benefits &ndash; a report from the Dubai Blochain Strategy predicts that 25.1 million economically productive hours can be reallocated through reduced document processing times and 114 MTons of C02 emissions eliminated through reduced trips.</p>\r\n\r\n<p>The report is particularly comprehensive in drawing on multiple sources citing the social and environmental benefits of blockchain application on government systems and databases, perhaps a significant indicator in the shifting tide of opinion towards the emerging technology.</p>\r\n",
  "created": {
    "$date": "2018-07-08T04:38:33.461Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b6e31a9832b890014354dde"
  },
  "title": "IOTA Founder Shut Out Of Directors Board",
  "image": "https://i.imgur.com/69Diuu0.png",
  "author": "skrill mandala",
  "category": "News",
  "intro": " fears of a major disagreement among senior management after a transcript of a discussion between the founders and the Board of Directors was leaked",
  "body": "<p dir=\"ltr\">A&nbsp;statement&nbsp;recieved by coinewsafrica&nbsp;explains that following a period of uncertainty over IOTA founders Serguei Popov and Sergey Ivancheglo&rsquo;s access to the Foundation&rsquo;s Board of Directors, a Memorandum of Understanding (MoU) would now allow them access.</p>\r\n\r\n<p dir=\"ltr\">IOTA being a&nbsp; German-registered non-profit, the&nbsp;Foundation needed to act within the law, meaning changing its measure&nbsp;is possible &ldquo;only by a supervisory board resolution,&rdquo; the statement reads. IOTA&rsquo;s Supervisory Board had not yet met, despite Popov and Ivancheglo waiting for Board of Directors&rsquo; access.</p>\r\n\r\n<p dir=\"ltr\">The statement notes that the &ldquo;circumstances lead to a situation, where two of the IOTA founders have been &lsquo;waiting for board seats&rsquo; for more than four months,&rdquo; adding:</p>\r\n\r\n<blockquote>\r\n<p dir=\"ltr\">&ldquo;Unfortunately, sufficient priority was not given to this open issue, and there was a failure to keep the missing board members informed about progress.&rdquo;</p>\r\n</blockquote>\r\n\r\n<p dir=\"ltr\">Tensions simmered under the status quo, resulting in Ivancheglo demanding embattled board chairman Dominik Schiener to quit. The statement notes that &ldquo;Sergey Ivancheglo has since stated that asking for Dominik to resign was an emotional reaction to the situation, which had built up over months. The situation did not feel fair to him, being an integral member of the team behind IOTA as we know it today.&rdquo;</p>\r\n\r\n<p dir=\"ltr\">The MoU should be in place by August 10, an makeshift&nbsp;ahead of the Supervisory Board&rsquo;s first meeting in September, IOTA&rsquo;s latest statement reads.</p>\r\n\r\n<p>Both the Foundation and Schiener have faced criticism over the past year. earlier this year in april,&nbsp;a&nbsp;scandal&nbsp;broke out after Schiener told an independent security researcher that she &ldquo;needed a slap. And in May, University College London&nbsp;cut its ties&nbsp;with IOTA altogether, due to threats from legal for posting their results.</p>\r\n",
  "created": {
    "$date": "2018-08-11T00:45:29.205Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b6e3e9de84f7e0014c4a51b"
  },
  "title": " The Financial Services Agency (FSA) of Japan, Has Put Up A Report Of Its Inspections Of Cryptocurrency Exchange ",
  "image": "https://i.imgur.com/hSlNyxK.png",
  "author": "lee simon",
  "category": "News",
  "intro": "the Finacial Services Agency (FSA) has to go with strict measures looking into new applications from exchanges hoping to get  an official operating license. Newly registered exchanges will be required to undergo on-site inspections at an early stage and the agency promised to look closely into their business model.",
  "body": "<p>On this day, The Financial Services Agency (FSA) of Japan, has put up a report of its inspections of cryptocurrency exchange operators.</p>\r\n\r\n<p>From the discovery, the Finacial Services Agency (FSA) has to go with strict measures looking into new applications from exchanges hoping to get&nbsp;&nbsp;an official operating&nbsp;license. Newly registered exchanges will be required to undergo on-site inspections at an early stage and the agency promised to look closely into their business model.</p>\r\n\r\n<p>According to various&nbsp;investigations, the total digital assets of domestic exchanges took a massive leap&nbsp;to 792.8 billion yen which is equvalent to&nbsp;($7.1 billion), over six times&nbsp;increase within the space of just one year. majority of exchanges&rsquo; workforces are fewer than 20 people, meaning that one employee on average was found to be managing digital assets worth 3.3 billion yen equivalent to&nbsp;($29.7 million). The&nbsp;document of problems across exchanges&rsquo; business models, risk management and compliance, internal audits, and corporate governance.</p>\r\n\r\n<p>FSA further highlighted concerns over insufficient&nbsp;anti-money laundering&nbsp;(AML) measures among few exchanges. the agency also stated it will continue to give priority to investor protection.&nbsp; &nbsp;</p>\r\n\r\n<p>The FSA made a statement in july,&nbsp;it was considering changing the legal structure for the&nbsp;regulation&nbsp;of cryptocurrency exchanges, Lately the agency was&nbsp;&nbsp;restructured&nbsp;in order improve its handling of fintech-related areas, including cryptocurrencies.</p>\r\n\r\n<p>A self-regulatory body, the Japan Virtual Currency Exchange Association (JVCEA),&nbsp;formed&nbsp;in early March in order to develop and coordinate policies in conjunction with the FSA. Last month, JVCEA released a statement&nbsp;it would be requiring its members to place maximum limits on the volumes traded by their customers.</p>\r\n",
  "created": {
    "$date": "2018-08-11T01:40:45.413Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b998c74f486fb0014f0cac5"
  },
  "title": "Blockchain Research gets Approval from Indian Government",
  "image": "https://i.imgur.com/b0EU27K.jpg",
  "author": "Gourav J",
  "category": "News",
  "intro": "Cryptocurrency officially recognised by indian banks",
  "body": "<p>The Republic of India is on the verge of making the blockchain technology more accessible in the country.</p>\r\n\r\n<p>India&#39;s Union Cabinet &ndash; an executive decision-making body composed of senior government officials and led by Prime Minister Narendra Modi &ndash; said according to Coindesk that it would allow the nation&#39;s Export-Import Bank (Exim Bank) to conduct research on distributed ledger and blockchain technology in partnership with banks in the BRICS economic bloc, of which India is a member, alongside Brazil, Russia, China and South Africa.</p>\r\n\r\n<p>The approval is ex-post facto, meaning that Exim Bank has already signed a Memorandum of Understanding under the BRICS Interbank Cooperation Mechanism, the Business Standard reported.</p>\r\n\r\n<p>Specifically, the banks &quot;intend to enhance understanding of distributed ledger/blockchain technology, through the joint research efforts to identify areas within respective business operations where it may have the potential for applications aimed at enhancing the operational efficiencies,&quot; the Financial Express reported.</p>\r\n\r\n<p>This brilliant move will also help further India&#39;s goal of developing a digital economy, Making operations in the financial sector more efficient is one hoped-for outcome of the research, according to the Express.</p>\r\n",
  "created": {
    "$date": "2018-09-12T22:00:20.693Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "5b9a0ab8f486fb0014f0cac6"
  },
  "title": "Star Xu Founder of OKEx Released From Police Questioning, Denies Fraud Charges",
  "image": "https://i.imgur.com/cqBob5o.jpg",
  "author": "Mark James",
  "category": "News",
  "intro": "Star Xu Finally Released From 24 Hours Detention",
  "body": "<p>OKEx Cryptocurrency exchange founder Star Xu formally hit back on September 12 at allegations of fraud after conflicting reports over why Chinese law enforcement summoned him to a police station for 24 hours Monday September 11, 2018.</p>\r\n\r\n<p>According to multiple local media sources, Star Xu, who is also the CEO of OKCoin, had faced problems at his hotel from a group of &ldquo;investors&rdquo; allegedly linked to WFEE Coin, a blockchain WiFi sharing project they said Xu held a certain percentage of shares in.</p>\r\n\r\n<p><br />\r\nAccording to <a href=\"https://cointelegraph.com/news/okex-founder-star-xu-released-from-police-questioning-denies-fraud-charges\">cointelegraph</a> who reached out to Xu with the findings, and the company also denied Xu had any equity involvement with WFEE.</p>\r\n\r\n<p>&ldquo;Mr. Xu has no equity relationship with WFEE and its company,&rdquo; COO Andy Cheung said, adding:</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><br />\r\nThough WFEE has acquired OKBC&#39;s [OK Blockchain Capital] and several other capitals&#39; investment, the afterward changes of WFEE white paper and team members have not been given notice to OKBC.&rdquo;<br />\r\nOK Blockchain Capital also tweeted that Xu is not a shareholder of WFEE.</p>\r\n\r\n<p>On Twitter, OKEx COO Cheung had stated September 12 that Xu experienced problems at a hotel, whereupon the police arrived and moved the parties involved to the police station, adding:</p>\r\n\r\n<p>&ldquo;While Star was invited to help with the investigation and those people was detained, they raised a fraud complaint against Star. Star stayed to clarify and then left afterwards.&rdquo;</p>\r\n\r\n<p>Xu added in his interview that it was &ldquo;normal&rdquo; for citizens to exercise their right to make such allegations, and that he had equally fulfilled his &ldquo;duty&rdquo; as a citizen by cooperating with the authorities.</p>\r\n",
  "created": {
    "$date": "2018-09-13T06:59:04.360Z"
  },
  "__v": 0
})
